/***********************************************************************************************************************
 *  COPYRIGHT
 *  --------------------------------------------------------------------------------------------------------------------
 *  \verbatim
 *  Copyright (c) 2023 by Vector Informatik GmbH.                                              All rights reserved.
 *
 *                This software is copyright protected and proprietary to Vector Informatik GmbH.
 *                Vector Informatik GmbH grants to you only those rights as set out in the license conditions.
 *                All other rights remain with Vector Informatik GmbH.
 *  \endverbatim
 *  --------------------------------------------------------------------------------------------------------------------
 *  FILE DESCRIPTION
 *  ------------------------------------------------------------------------------------------------------------------*/
/**
 * \ingroup     Os_Hal
 * \defgroup    Os_Hal_Core HAL Core.
 * \trace       CREQ-1201
 *
 * \{
 * \file        Os_Hal_CoreInt.h
 * \brief       Declares core and multi-core related primitives.
 * Internal comment removed.
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 **********************************************************************************************************************/

/***********************************************************************************************************************

# include "Os_Hal_Core_Types.h"
# include "Os_Core_Types.h"
# include "Os_Hal_InterruptInt.h"
# include "Os_Hal_MemoryProtectionInt.h"
# include "Os_Core_Cfg.h"

/* Os HAL dependencies */


/***********************************************************************************************************************
 *  GLOBAL CONSTANT MACROS
 **********************************************************************************************************************/

/*! \brief    This define is used to mask the MSR bits that are not controlled by the OS (user bits).
 *  \details
 *  The define is needed during core initialization and context switch to avoid destroying the user configuration
 *  of the MSR (Machine State Register).
 */
# define OS_HAL_CORE_MSR_USER_BIT_MSK           (0xFEFFFE00uL)

/*! Defines whether the HAL provides a count leading zeros command (STD_ON) or not (STD_OFF). */
# define OS_HAL_COUNT_LEADING_ZEROS_HARDWARE     STD_ON

/*! The required address width to subscript the bits of a Os_Hal_CoreBitFieldType.
 * The value can be selected from the following table:
 * typeof(Os_Hal_BitFieldType)      | OS_HAL_INDEXBITWIDTH
 * :------------------------------: | :----------------------------
 * uint8                            | 3
 * uint16                           | 4
 * uint32                           | 5
 * uint64                           | 6
 */
# define OS_HAL_INDEXBITWIDTH       (5)

/*! Defines the value which is returned by \ref Os_Hal_SpinTryLock, if locking succeeded. */
# define OS_HAL_SPINLOCKSUCCEEDED    ((Os_Hal_SpinlockResultType)0uL)

/****** Cortex-AR specific defines ******/
/*! Multiprocessor Affinity Register (MPIDR):  Multi processor ID bit mask. */
# define OS_HAL_MULTIPROCESSOR_ID_MASK          (3uL)
# define OS_HAL_MULTIPROCESSOR_GROUP_MASK       (0x0000FF00uL)
/*! CPSR Register: IRQ Interrupt state bit mask. */
# define OS_HAL_PSR_INTERRUPTS_MASKED           (1uL << 7)
/*! CPSR Register: FIQ Interrupt state bit mask. */
# define OS_HAL_PSR_INTERRUPTS_MASKED_FIQ       (1uL << 6)
/*! CPSR Register: IRQ, FIQ not masked. */
# define OS_HAL_PSR_INTERRUPTS_ENABLE_GLOBAL    (0uL)


/***********************************************************************************************************************
 *  GLOBAL FUNCTION MACROS
 **********************************************************************************************************************/

/***********************************************************************************************************************
 *  GLOBAL DATA TYPES AND STRUCTURES
 **********************************************************************************************************************/

/*! Platform specific core data. */
typedef uint32 Os_Hal_CoreType;

/*! \brief    Platform specific core configuration for AUTOSAR and Non-AUTOSAR cores.
 *  \details  Contains information for starting cores and master-slave emulation, if needed.
 */
struct Os_Hal_CoreConfigType_Tag
{
  /*!< Physical core ID.
  
       Note: 
       This type is used by the generated OsCfg_Hal_Core_OsCoreX const.
       For Zuxx, in the generated OsCfg_Hal_Core_OsCoreX const, physical core ID values (0,1) are used instead of
       preconfigured BSWMD physical core ID values (2,3). */
  uint32 CoreId;
};

/*! \brief    Struct for a core variable used at exception entry to save registers which are overwritten 
 *            afterwards to switch to kernel stack.
 *            
 *  \details  The usage of a var avoids pushing those registers to the stack which might otherwise cause 
 *            another exception.
 *            Each core has its own variable.
 */
struct Os_Hal_ExcEntryRegSaveType_Tag
{
  /* 0x00 */ uint32 R0;
  /* 0x04 */ uint32 R1;
  /* 0x08 */ uint32 R2;
  /* 0x0C */ uint32 R3;
  /* 0x10 */ uint32 R4;
  /* 0x14 */ uint32 R5;
  /* 0x18 */ uint32 LR_exc;
  /* 0x1C */ uint32 SPSR_exc;
  /* 0x20 */ uint32 SP_sys;
  /* 0x24 */ uint32 LR_sys;  
  /* 0x28 */ uint32 StackRegion_DRBAR;
  /* 0x2C */ uint32 StackRegion_DRACR;
  /* 0x30 */ uint32 StackRegion_DRSR;
};

/*! \brief    Platform specific AUTOSAR core configuration.
 *  \details  Contains the core specific interrupt and exceptions tables.
 */
struct Os_Hal_CoreAsrConfigType_Tag
{
  CONSTP2VAR(Os_Hal_ExcEntryRegSaveType, AUTOMATIC, OS_VAR_NOINIT_FAST) ExcEntryRegSaveVarRef;  /*!< Pointer holding the address of the core struct var used to save registers on exception entry. */
  Os_Hal_ExceptionTableType ExceptionTable;                                                     /*!< Pointer to exception vector table. */
  Os_Hal_VectorTableType IrqVectorTable[OS_HAL_NUMBER_OF_VECTOR_TABLES];                        /*!< Pointer to Irq vector tables. */
  Os_Hal_VectorTableType FiqVectorTable;                                                        /*!< Pointer to Fiq vector table. */
  Os_AddressOfConstType StackProtectionStartLabel;                                              /*!< Start label of the cores stack section. */
